<script>
  import { Card, Input, Alert } from 'sveltestrap';
	import Icon from '@iconify/svelte';
  export let onClose = () => {};
</script>

<Card
	class="tw-absolute z-10 tw-flex tw-flex-row tw-rounded-none sm:tw-rounded-xl tw-w-[100vw] tw-h-[100vh] sm:tw-w-[450px] sm:tw-h-auto tw-shadow-2xl"
>
	<button class="tw-absolute tw-right-0 tw-top-0 tw-p-5" on:click={onClose}>
		<Icon icon="bytesize:close" class="tw-text-sm" />
	</button>
	<form class="tw-py-6 tw-px-10 tw-w-full" on:submit={(e) => e.preventDefault()}>
		<header class="tw-text-center tw-mb-5 tw-text-xl tw-text-slate-600">로그인</header>
		<div>
      베라디이용약관

      제 1 장 총칙
      
      제1조(목적)
      본 약관은 “주식회사 베라디(이하 ‘회사’)”가 운영하는 웹사이트(이하 '본 www.베라디.co.kr')를 통하여  제공하는 교육 콘텐츠 및 서비스의 이용과 관련하여 회사와 이용자 간의 권리•의무 및 책임사항을 규정하는데 그 목적이 있고, 본 사이트 중에서 하나의 아이디(ID)로 본 사이트의 모든 서비스를 이용할 수 있습니다.
      회사는 위 서비스를 조금 더 편리하고 쉽게 이용하실 수 있는 통합 회원 정책을 통하여, 필요한 서비스를 원활하게 이용 할 수 있도록 합니다.
      
      제2조(용어의정의)
      ① 본 약관에서 사용하는 용어의 정의는 다음과 같습니다.
      “이용자”라 함은 회사의 사이트에 접속하여 이 약관에 따라 회사가 제공하는 콘텐츠 및 제반서비스를 이용하는 회원 및 비회원을 말합니다.
      “회원”이라 함은 회사와 이용계약을 체결하고 이용자 아이디(ID)를 부여받은 이용자로서 회사의 정보를 지속적으로 제공받으며 회사가 제공하는 서비스를 지속적으로 이용할 수 있는 자를 말합니다.
      “콘텐츠”라 함은 정보통신망이용촉진 및 정보보호 등에 관한 법률 제2조 제1항의 규정에 의한 정보통신망에서 사용되는 부호·문자·음성·음향·이미지 또는 영상 등으로 표현된 자료 또는 정보로서, 그 보존 및 이용에 있어서 효용을 높일 수 있도록 전자적 형태로 제작 또는 처리된 것을 말합니다.
      “아이디(ID)”라 함은 회원의 식별과 서비스이용을 위하여 회원이 정하고 회사가 승인하는 문자 또는 숫자의 조합을 말합니다.
      “비밀번호(PASSWORD)”라 함은 회원이 부여받은 아이디와 일치되는 회원임을 확인하고 비밀보호를 위해 회원 자신이 정한 문자 또는 숫자의 조합을 말합니다.
      “운영자(관리자)”라 함은 서비스의 전반적인 관리와 원활한 운영을 위하여 회사에서 선정한 사람 혹은 기관(회사)를 말합니다.
      “게시물”이라 함은 회원이 서비스를 이용함에 있어 회사의 사이트에 게시한 문자, 부호, 음향, 화상, 동영상 등의 정보 형태의 글, 사진, 동영상 및 각 종 파일과 링크, 댓글 등의 정보를 말합니다.
      “서비스의 제한, 중지”라 함은 공공의 이익 또는 회사의 규정에 위배되는 경우에 회사가 회원에게 제공하는 서비스의 전부 또는 일부를 제한하거나 중지하는 것을 의미합니다.
      “탈퇴”라 함은 회사 또는 회원이 사이트에서 제공받는 서비스를 종료시키는 것을 의미합니다.
      ② 이 약관에서 사용하는 용어의 정의는 제1항에서 정한 것을 제외하고는 거래 관행 및 관계 법령을 따릅니다.
      
      제3조(약관의 명시와 개정)
      ① 이용자가 정해진 회원가입 절차를 거쳐 회원등록을 완료하면 본 약관에 동의한 것으로 간주합니다.
      ② 회사는 “약관의 규제에 관한 법률”, “전자거래기본법”, “전자서명법”, “정보통신망이용촉진 등에 관한 법률(이하'정보통신망이용촉진법')”, “방문판매 등에 관한 법률”, “소비자보호법” 등 관련법을 위배하지 않는 범위에서 임의로 이 약관을 개정할 수 있습니다.
      ③ 회사가 약관을 개정할 경우에는 적용 일자 및 개정 사유를 명시하여 현행 약관과 함께 본 사이트의 초기화면에 그 적용일자 7일 이전부터 적용일자 전일까지 공지합니다. 다만, 이용자에게 불리하게 약관내용을 변경하는 경우에는 최소한 30일 이상의 사전 유예기간을 두고 공지합니다. 이 경우 회사는 개정 전 내용과 개정 후 내용을 명확하게 비교하여 이용자가 알기 쉽도록 표시합니다.
      ④ 회원이 개정약관의 적용에 동의하지 않는 경우 회원은 서비스 이용계약을 해지할 수 있습니다. 단, 변경된 약관의 효력발생일 이후에도 서비스를 계속 이용할 경우 약관의 변경사항에 동의한 것으로 간주합니다.
      
      제4조 (약관이 정하지 않은 사항)
      본 약관에서 정하지 아니한 사항과 이 약관의 해석에 관하여는 정부가 제정한 “전자거래소비자보호지침 및 관계법령” 또는 “상관례”에 따릅니다.
      
      제 2 장 회원가입
      
      제5조(회원가입)
      ① 이용자는 회사가 정한 방법으로 이용신청서를 작성한 후 본 약관에 동의한다는 의사표시를 함으로써 회원가입을 신청합니다.
      ② 회사는 제1항과 같이 회원으로 가입할 것을 신청한 이용자 중 다음 각 호에 해당하는 이용자에 대하여는 서비스의 제공을 거부하거나 제한할 수 있습니다.
      가. 이용신청서에 기입한 이름이 본인의 실명이 아닐 경우
      나. 이용신청서의 내용을 허위로 작성하였거나 기재를 누락하거나 오기가 있는 경우
      다. 사회적 통념상 공공의 질서 및 사회 미풍양속을 해할 목적으로 신청한 경우
      라. 회사의 정당한 업무 수행에 지장을 주는 경우
      마. 기타 회원으로 등록하는 것이 회사의 기술상 현저히 지장이 있다고 판단되거나 이용신청자의 귀책사유로 이용승낙이 곤란한 경우
      ③ 회원가입계약의 성립 시기는 회사의 승낙이 회원에게 도달한 시점으로 합니다.
      ④ 이용자가 만14세 미만인 경우에는 법정대리인의 동의가 있어야 가입신청을 할 수 있으며 회사는 이의 확인을 위해 필요한 조회를 할 수 있습니다.
      ⑤ 회원은 등록사항에 변경이 있는 경우, 즉시 전자우편 및 기타 방법으로 회사에 그 변경사항을 알려야 합니다.
      
      제6조(회원의 의무)
      ① 회원은 공공의 질서 및 미풍양속을 저해하는 다음의 각 호에 관련되는 통신활동을 하여서는 안 됩니다.
      가. 타 회원의 아이디(ID) 및 비밀번호를 사용하는 행위
      나. 회사가 제공하는 서비스를 통하여 얻은 정보를 회사의 사전 승낙 없이 허가용도 이외의 목적으로 사용하거나 복제, 유통, 상업적으로 이용하려는 행위
      다. 타 회원이나 제3자의 지적재산권 및 기타 권리를 침해하는 행위
      라. 타 회원의 명예를 손상시키거나 고의적으로 불이익을 주는 행위
      마. 범죄행위를 목적으로 하거나 범죄행위를 교사하는 내용 및 저질, 음란성 내용을 유포하는 행위(기타 사회질서에 위배되는 행위 )
      바. 회사의 동의를 받지 아니하고 서비스의 내용과 관련 없는 내용 및 광고 등을 권유하거나, 게시 등 기타 다른 방법으로 전달하는 행위
      사. 정보 서비스를 위해하거나 혼란을 일으키는 해킹을 하거나 컴퓨터 바이러스 전염, 유포하는 행위
      아. 기타 관계되는 법령에 위배되는 행위
      ② 아이디(ID)와 비밀번호의 관리 책임은 회원 본인에게 있으며 관리소홀로 인해 발생되는 모든 결과의 책임은 회원 본인에게 있습니다.
      ③ 본 서비스에 있어 회원의 아이디(ID)는 동시에 중복 사용할 수 없도록 되어 있으므로 타인에게 노출된 경우 즉시 비밀번호를 바꾸고 회사에 이를 통보해야 합니다.
      ④ 회원은 본 약관에서 규정하는 사항 및 주의사항을 준수하여야 합니다.
      
      제7조(회원 탈퇴 및 자격 상실 등)
      ① 회원은 탈퇴하고자 할 경우 본인이 회사의 사이트를 통하거나 서면 또는 전화, 전자 우편 등의 방법으로 탈퇴를 요청할 수 있으며, 회사는 탈퇴 요청이 접수되는 경우 그 익일부터 당해 회원에 대하여 서비스를 중지합니다.
      ② 회사는 회원이 다음 각 호에 해당하는 행위를 하였을 경우에는 사전 통지 없이 회원 자격을 제한하거나 정지시킬 수 있습니다.
      가. 타인의 이용자번호(ID) 및 비밀번호를 도용한 경우
      나. 이용 가입 시 이용계약에 위반되는 허위사실을 기입하였을 경우
      다. 컴퓨터 바이러스를 고의로 유포시켰을 경우
      라. 다른 이용자가 본 사이트를 이용하는 것을 방해하거나 그 정보를 도용하는 등 전자거래질서를 위협하는 경우
      마. 본 사이트를 이용하여 기타 관련 법률과 이 약관이 금지하는 행위를 하거나 미풍양속에 반하는 행위를 하는 경우
      바. 기타 회사가 정한 이용신청요건이 미비 되었을 때
      ③ 회사는 다음 각 호에 해당하는 회원가입신청에 대하여는 승낙을 유보할 수 있습니다.
      가. 설비에 여유가 없는 경우
      나. 기술상의 지장이 있는 경우
      다. 기타 회원가입신청을 유보하지 않을 수 없는 불가피한 사유가 있는 경우
      라. 기타 본 약관의 규정을 위반하는 경우
      ④ 회사가 회원 자격을 제한•정지시킨 후, 동일한 행위가 2회 이상 반복되거나 30일 이내에 그 사유가 시정되지 아니하는 경우 회사는 회원 자격을 상실시킬 수 있습니다.
      ⑤ 회사가 회원자격을 상실시키는 경우에는 회원등록을 말소하며, 이 경우 회원에게 이를 통지하고, 회원등록 말소 전에 소명할 기회를 부여합니다.
      ⑥ 제2항의 경우, 회사는 회원에게 손해배상을 청구할 수 있습니다.
      
      제 3 장 개인정보
      
      제8조(개인정보 수집)
      ① 회사는 적법하고 공정한 수단에 의하여 서비스이용계약의 성립 및 이행에 필요한 최소한의 개인정보를 수집합니다.
      ② 회사는 회원에게 보다 나은 서비스를 제공하기 위해 관심 분야 관한 추가정보를 수집할 수 있고, 이 경우 회원의 동의를 얻어야 합니다.
      
      제9조(수집의 범위)
      ① 회사는 회원가입신청시 기본적인 서비스 제공을 위해 이름, 아이디, 비밀번호, e-mail 주소, 거주지 주소(우편번호 포함), 전화번호, 이동전화번호, 자녀정보 등에 관한 개인정보를 수집합니다.
      ② 회사는 회원의 기본적 인권을 현저하게 침해할 우려가 있는 내용은 수집하지 않습니다.
      
      제10조(개인정보의 제3자 제공의 금지)
      ① 회사는 개인정보를 회원의 동의 없이 제3자에게 제공하지 않습니다. 단, 다음 각 호의 경우에는 예외로 합니다.
      가. 정보통신망이용촉진법 등 법률에 특별한 규정이 있는 경우
      나. 서비스이용계약의 이행을 위하여 필요한 경우
      다. 통계작성, 학술연구 또는 시장조사를 위하여 필요한 경우로서 특정 개인을 식별할 수 없는 형태로 제공하는 경우
      ② 회사는 회원의 개인정보를 회사의 제휴 사이트에서 활용할 수 있습니다.
      
      제11조(개인정보의 동의 철회, 열람 또는 정정)
      ① 회원 또는 회원의 법정대리인은 언제든지 개인정보의 수집 및 이용, 목적 외의 사용, 제3자 제공에 대한 동의를 철회할 수 있습니다.
      ② 회원 또는 회원의 법정대리인은 웹사이트 “정보수정” 페이지에서 언제든지 자신의 개인정보를 열람할 수 있으며, 스스로 정보 및 오류를 수정할 수 있습니다.
      
      제12조(개인정보의 보유 및 이용기간, 파기)
      회사는 회원이 탈퇴하거나 제11조 1항에 따라 동의를 철회하는 경우, 지체 없이 수집된 회원정보를 파기하는 등 필요한 조치를 취합니다.
      
      제 4 장 회사와 이용자의 의무사항
      
      제13조(회사의 의무)
      ① 회사는 관계법령 및 이 약관에서 금지하는 행위를 하지 않습니다.
      ② 회사는 지속적이고 안정적인 서비스를 제공하기 위해 노력합니다.
      ③ 회사는 서비스를 이용하는 회원이 제기하는 의견이나 불만사항이 정당하다고 인정되면 즉시 처리합니다.
      다만, 즉시 처리가 불가능한 경우에는 회원에게 그 사유와 처리되는 일정을 통지하여야 합니다.
      
      제14조(회원에 대한 통지)
      ① 회사가 회원에 대한 통지를 하는 경우, 회원이 회사에 제출한 전자 우편 주소로 할 수 있습니다.
      ② 회사는 불특정다수 회원에 대하여 통지를 하는 경우, 1주일 이상 회사의 게시판에 게시함으로써 개별 통지에 갈음할 수 있습니다.
      
      제15조(정보의 제공)
      회사는 회원이 서비스를 이용하는 데 필요하다고 인정되는 다양한 정보를 전자우편이나 기타의 방법 등으로 회원에게 제공할 수 있으나, 회원은 회사에 대하여 전자 우편으로 수신을 거부하는 의사를 표시할 수 있습니다.
      
      
      제16조(서비스의 이용)
      ① 회원은 가입 신청 시 회원이 지정한 회원 아이디와 비밀번호를 이용하여 본 사이트에 로그인한 후 서비스를 이용할 수 있습니다.
      ② 회원가입 신청 시 작성한 개인정보는 서비스 제공을 위하여 회사에서 운영하는 웹사이트에서 공유합니다 .
      ③ 회원은 서비스 이용 중 필요에 따라 아이디를 제외한 비밀번호와 개인 신상 정보를 온라인 홈페이지 개인정보 페이지를 통하여 직접 변경할 수 있습니다 .
      ④ 회원 종류에 따라 서비스 이용의 일부가 제한될 수 있습니다 .
      ⑤ 회사는 회원의 이용 신청을 승낙한 때부터 서비스를 개시합니다 .
      ⑥ 회사의 업무상 또는 기술상의 장애로 인하여 서비스를 개시하지 못하는 경우에는 사이트에 이를 공시하여 통지하며, 불가피한 기술상의 이유 등에 의해 서비스 이용이 불가할 경우 이에 따른 법적인 손해배상의 의무를 지지 않습니다.
      
      제17조(서비스 제공의 중지)
      ① 회사는 다음 각 호에 해당하는 경우 서비스 제공을 중지할 수 있습니다.
      가. 설비의 보수점검•교체 및 고장, 통신 두절 등의 사유로 인한 경우
      나. 기타 불가항력적인 경우
      ② 천재지변, 국가비상사태 등의 불가항력적인 경우를 제외하고는 사전에 이를 게시하거나 공지합니다.
      ③ 천재지변, 국가비상사태 등의 불가항력적인 사유로 서비스의 제공을 중지한 경우에는, 당해 사유가 해소되는 즉시 이를 게시하거나 회원에게 통지하여야 합니다.
      
      제18조(서비스의 제공)
      ① 회사는 업무상 또는 기술상 문제가 없는 한 365일 무휴 1일 24시간 서비스를 제공하기로 합니다. 다만, 시스템 점검, 증설과 교체 및 고장 등의 이유로 회사가 정한 기간에는 서비스가 일시 중지될 수 있습니다. 이경우 회사는 해당 사실을 회원에게 사전 또는 사후에 공지합니다.
      ② 회사는 특정 회원이나 일부 서비스에 대해 이용가능 시간을 별도로 지정할 수 있습니다. 이 경우, 사전에 게시하여 공지합니다.
      
      제19조(게시물 삭제)
      회사는 회원이 게시하거나 전달하는 서비스 내의 모든 내용물이 아래 각 호의 경우에 해당한다고 판단되는 경우 사전통지 없이 삭제할 수 있으며, 이에 대해 '회사'는 어떠한 책임도 지지 않습니다.
      ① 다른 회원 또는 제3자를 비방하거나 명예를 손상시키는 내용인 경우
      ② 다량의 정보를 전송하여 서비스의 안정적 운영을 방해하는 경우
      ③ 허위 사실 유포 및 수신자의 의사에 반하는 광고성 정보를 전송하는 경우
      ④ 공공질서 및 미풍양속에 위반되는 내용인 경우
      ⑤ 제3자의 지적재산권을 침해하는 내용인 경우
      ⑥ 기타 이 약관이나 법령에 위반된다고 판단되는 경우
      
      제 5 장 기타
      
      제20조(계약사항의 변경)
      회원이 서비스이용계약의 내용을 변경하고자 하는 경우에는 회사의 약관 및 이용안내에서 정한 바에 따라 이용계약의 변경신청서나 전화 등을 이용하여 변경할 수 있습니다.
      
      제21조(지적재산권)
      ① 서비스와 관련된 저작권 등 일체의 지적재산권은 회사에 귀속합니다.
      ② 이용자는 서비스를 이용함으로서 얻은 정보를 회사의 사전 승낙 없이 복제, 송신, 출판, 배포, 방송 기타 방법에 의하여 영리목적으로 이용하거나 제3자에게 이용하게 하여서는 안됩니다.
      ③ 본 사이트에 회원이 게재한 자료와 게시물에 대한 권리와 책임은 게시 당사자에게 있으며 회사는 당해 회원의 동의 없이 이를 영리적인 목적으로 사용하지 않습니다.
      
      제22조(책임의 면제)
      ① 회사는 회원의 부주의나 고의로 인해서 발생된 어떠한 손해에 대해서도 책임을 지지 않습니다.
      ② 회사는 회원이 회사의 서비스로부터 기대한 이익을 얻지 못하였거나, 서비스를 통해 취득한 자료를 취사 선택하거나 이용함으로 인하여 입게된 손해에 대하여 책임을 지지 않습니다.
      ③ 회사는 회원의 귀책사유로 인한 서비스 이용의 장애에 대하여 책임을 지지 않습니다.
      ④ 회사는 타인이 게시 또는 전송한 자료의 내용으로 인하여 회원에게 발생한 손해에 대해서는 책임을 지지 않습니다.
      ⑤ 회사는 천재지변 등의 불가항력으로 인해 서비스를 제공할 수 없게 되어 발생한 손해에 대하여는 책임을 지지 않습니다.
      ⑥ 회사가 제휴 사이트와의 계약에 의해 서비스를 제공하는 경우, 제휴 사이트가 제공하는 서비스로 인하여 발생하는 어떠한 손해에 대하여도 책임을 지지 않습니다.
      제29조(분쟁 시 준거법과 관할법원)
      ① 회사와 회원은 서비스와 관련하여 발생한 분쟁을 원만하게 해결하기 위하여 필요한 모든 노력을 하여야 합니다.
      ② 전항의 경우에도 불구하고 분쟁으로 인한 소송이 제기될 경우 동 소송은 민사소송법상의 관할법원에 제기합니다.
      ③ 회사와 이용자간에 발생하는 분쟁에 관하여는 대한민국 법을 적용합니다.
      
      부칙(시행일)
      ① 본 이용약관은 2022년  월  일부터 적용됩니다.
      ② 이 약관 시행 전 종전의 이용약관에 따라 가입한 고객은 변경된 시행일로부터 이 약관의 적용을 받습니다.
      
      
                  
		</div>
	</form>
</Card>