<script context="module">
  export const IntroductionSwiperInfo = [
    {
      name: "화학 B팀 팀장 박*련",
      content: "팀원들과 프로젝트를 진행하며 협력하는 자세를 배울 수 있고, 편안한 분위기에서 일을 하니 재미있고 효율이 높아집니다."
    },
    {
      name: "화학 B팀 파트장 국*호",
      content: "베라디는 젊고 트렌디한 회사입니다. 사소한 것도 꼼꼼하게 확인하고 토론해, 서로 알아가고 배워가는 팀 문화가 성장의 원동력입니다."
    },
    {
      name: "물리학 1팀 팀장 윤*호",
      content: "매년 드라마틱하게 성장하며, 최고의 팀원들과 함께 끝없는 우상향 그래프를 그리고 있습니다. 이곳에서 물리학 컨텐츠의 미래를 꿈꾸고 있습니다."
    },
    {
      name: "물리학 1팀 서브메인 고*현",
      content: "개인의 능력에 따라 대우를 받고, 노력하는 사람일수록 더 많은 경험을 할 수 있습니다. 잘 짜여져 있는 시스템 속에서 많은 것을 배우고 있습니다."
    },
  ]

</script>